testCase/0.orig/include/sideAndTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/



side1
{
    type cyclic;
}

side2
{
    type cyclic;
}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
